In [70]:
from pydataset import data
import pandas as pd
import numpy as np
import plotly as py
from Acquire_exercise import get_iris_data, read_csv, get_titanic_data, get_telco_data
from sklearn.model_selection import train_test_split

In [2]:
df_iris = data('iris')

#### Print first 3 rows of iris df.

In [3]:
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

#### print the number of rows and columns (shape)

In [4]:
df_iris.shape

(150, 5)

#### print the column names

In [5]:
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

#### print the data type of each column

In [6]:
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

#### print the summary statistics for each of the numeric variables

In [7]:
df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

## Read the data from this google sheet into a dataframe, df_google.

In [8]:
df_google = read_csv('TRAIN - train.csv')

In [9]:
df_google

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

#### print the first 3 rows

In [10]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

#### print the number of rows and columns

In [11]:
df_google.shape

(891, 12)

#### Print the column names.

In [12]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

#### print the data type of each column

In [13]:
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

#### print the summary statistics for each of the numeric variables

In [14]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [15]:
df_google.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

## Download the previous exercise's file into an excel (File → Download → Microsoft Excel). Read the downloaded file into a dataframe named df_excel.

In [16]:
df_excel = pd.read_excel('train.xlsx')

In [17]:
df_excel

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3.0,1.0,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S
3,4.0,1.0,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803.0,53.1000,C123,S
4,5.0,0.0,3.0,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450.0,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887.0,0.0,2.0,"Montvila, Rev. Juozas",male,27.0,0.0,0.0,211536.0,13.0000,NaN,S
887,888.0,1.0,1.0,"Graham, Miss. Margaret Edith",female,19.0,0.0,0.0,112053.0,30.0000,B42,S
888,889.0,0.0,3.0,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2.0,W./C. 6607,23.4500,NaN,S
889,890.0,1.0,1.0,"Behr, Mr. Karl Howell",male,26.0,0.0,0.0,111369.0,30.0000,C148,C
890,891.0,0.0,3.0,"Dooley, Mr. Patrick",male,32.0,0.0,0.0,370376.0,7.7500,NaN,Q

#### assign the first 100 rows to a new dataframe, df_excel_sample

In [18]:
df_excel_sample = df_excel.head(100)

#### print the number of rows of your original dataframe

In [19]:
len(df_excel)

891

#### print the first 5 column names

In [20]:
df_excel.columns[0:5]

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex'], dtype='object')

#### print the column names that have a data type of object

In [21]:
for x in df_excel.columns:
    if df_excel[x].dtype == 'O':
        print(x)

Name
Sex
Ticket
Cabin
Embarked

#### compute the range for each of the numeric variables.

In [22]:
numeric_vars = []
for x in df_excel.columns:
    if df_excel[x].dtype != 'O':
        numeric_vars.append(x)

In [23]:
df_excel[numeric_vars].max() - df_excel[numeric_vars].min()

PassengerId    890.0000
Survived         1.0000
Pclass           2.0000
Age             79.5800
SibSp            8.0000
Parch            6.0000
Fare           512.3292
dtype: float64

## Make a new python module, acquire.py to hold the following data aquisition functions:

## Prepare exercises

### Using the Iris Data:

Use the function defined in acquire.py to load the iris data.

In [77]:
fresh_iris = get_iris_data()

In [78]:
fresh_iris.head()

,Unnamed: 0,species_id,species_name,measurement_id,sepal_length,sepal_width,petal_length,petal_width
0,0,1,setosa,1,5.1,3.5,1.4,0.2
1,1,1,setosa,2,4.9,3.0,1.4,0.2
2,2,1,setosa,3,4.7,3.2,1.3,0.2
3,3,1,setosa,4,4.6,3.1,1.5,0.2
4,4,1,setosa,5,5.0,3.6,1.4,0.2

Drop the species_id and measurement_id columns.

In [26]:
my_iris= fresh_iris.drop(columns = {'species_id','measurement_id','Unnamed: 0'})

In [27]:
my_iris.head()

  species_name  sepal_length  sepal_width  petal_length  petal_width
0       setosa           5.1          3.5           1.4          0.2
1       setosa           4.9          3.0           1.4          0.2
2       setosa           4.7          3.2           1.3          0.2
3       setosa           4.6          3.1           1.5          0.2
4       setosa           5.0          3.6           1.4          0.2

Rename the species_name column to just species.

In [28]:
my_iris = fresh_iris.rename(columns = {'species_name':'species'})

In [29]:
my_iris.head()

,Unnamed: 0,species_id,species,measurement_id,sepal_length,sepal_width,petal_length,petal_width
0,0,1,setosa,1,5.1,3.5,1.4,0.2
1,1,1,setosa,2,4.9,3.0,1.4,0.2
2,2,1,setosa,3,4.7,3.2,1.3,0.2
3,3,1,setosa,4,4.6,3.1,1.5,0.2
4,4,1,setosa,5,5.0,3.6,1.4,0.2

Create dummy variables of the species name and concatenate onto the iris dataframe. (This is for practice, we don't always have to encode the target, but if we used species as a feature, we would need to encode it).

In [30]:
my_iris['encoded_species'] = fresh_iris['species_name'].map({'setosa':1,'versicolor':2,'virginica':3})

In [31]:
my_iris.head()

,Unnamed: 0,species_id,species,measurement_id,sepal_length,sepal_width,petal_length,petal_width,encoded_species
0,0,1,setosa,1,5.1,3.5,1.4,0.2,1
1,1,1,setosa,2,4.9,3.0,1.4,0.2,1
2,2,1,setosa,3,4.7,3.2,1.3,0.2,1
3,3,1,setosa,4,4.6,3.1,1.5,0.2,1
4,4,1,setosa,5,5.0,3.6,1.4,0.2,1

Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [32]:
def prep_iris(fresh_iris):
    iris = fresh_iris.drop(columns = {'species_id','measurement_id','Unnamed: 0'})
    iris = iris.rename(columns = {'species_name':'species'})
    iris['encoded_species'] = iris['species'].map({'setosa':1,'versicolor':2,'virginica':3})
    return iris

In [33]:
prep_iris(fresh_iris).head()

,species,sepal_length,sepal_width,petal_length,petal_width,encoded_species
0,setosa,5.1,3.5,1.4,0.2,1
1,setosa,4.9,3.0,1.4,0.2,1
2,setosa,4.7,3.2,1.3,0.2,1
3,setosa,4.6,3.1,1.5,0.2,1
4,setosa,5.0,3.6,1.4,0.2,1

### Using the Titanic dataset

Use the function defined in acquire.py to load the Titanic data.

In [34]:
FreshTitanic = get_titanic_data()

In [35]:
FreshTitanic.head()

,Unnamed: 0,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

Drop any unnecessary, unhelpful, or duplicated columns.

In [36]:
myTitanic = FreshTitanic.drop(columns = {'passenger_id', 'Unnamed: 0'})

In [37]:
myTitanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

In [38]:
myTitanic['encoded_class'] = myTitanic['class'].map({'First': 1, 'Second': 2, 'Third': 3})
myTitanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone,encoded_class
0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0,3
1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0,1
2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1,3
3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0,1
4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1,3

Create a function named prep_titanic that accepts the raw titanic data, and returns the data with the transformations above applied.

In [39]:
def prep_titanic(FreshTitanic):
    Titanic = FreshTitanic.drop(columns = {'passenger_id', 'Unnamed: 0'})
    Titanic['encoded_class'] = FreshTitanic['class'].map({'First': 1, 'Second': 2, 'Third': 3})
    return Titanic

In [40]:
prep_titanic(FreshTitanic)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone,encoded_class
0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0,3
1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0,1
2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1,3
3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0,1
4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,NaN,Southampton,1,2
887,1,1,female,19.0,0,0,30.0000,S,First,B,Southampton,1,1
888,0,3,female,NaN,1,2,23.4500,S,Third,NaN,Southampton,0,3
889,1,1,male,26.0,0,0,30.0000,C,First,C,Cherbourg,1,1
890,0,3,male,32.0,0,0,7.7500,Q,Third,NaN,Queenstown,1,3

Using the Telco dataset

Use the function defined in acquire.py to load the Telco data.

In [57]:
FreshTelco = get_telco_data()
FreshTelco

,Unnamed: 0,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,paperless_billing,payment_type_id,monthly_charges,total_charges,churn,payment_type_id.1,monthly_charges.1,total_charges.1,contract_type,internet_service_type
0,0,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,2,65.60,593.3,No,2,65.60,593.3,One year,DSL
1,1,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,2,59.90,542.4,No,2,59.90,542.4,Month-to-month,DSL
2,2,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,Yes,1,73.90,280.85,Yes,1,73.90,280.85,Month-to-month,Fiber optic
3,3,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,Yes,1,98.00,1237.85,Yes,1,98.00,1237.85,Month-to-month,Fiber optic
4,4,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,2,83.90,267.4,Yes,2,83.90,267.4,Month-to-month,Fiber optic
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,7038,1,2,9987-LUTYD,Female,0,No,No,13,Yes,...,No,2,55.15,742.9,No,2,55.15,742.9,One year,DSL
7039,7039,2,1,9992-RRAMN,Male,0,Yes,No,22,Yes,...,Yes,1,85.10,1873.7,Yes,1,85.10,1873.7,Month-to-month,Fiber optic
7040,7040,1,1,9992-UJOEL,Male,0,No,No,2,Yes,...,Yes,2,50.30,92.75,No,2,50.30,92.75,Month-to-month,DSL
7041,7041,1,3,9993-LHIEB,Male,0,Yes,Yes,67,Yes,...,No,2,67.85,4627.65,No,2,67.85,4627.65,Two year,DSL
7042,7042,1,3,9995-HOTOH,Male,0,Yes,Yes,63,No,...,No,1,59.00,3707.6,No,1,59.00,3707.6,Two year,DSL

Drop any unnecessary, unhelpful, or duplicated columns. This could mean dropping foreign key columns but keeping the corresponding string values, for example.

In [58]:
df = FreshTelco.T.drop_duplicates().T
df = df.drop(columns = {'internet_service_type', 'customer_id','Unnamed: 0'})

In [59]:
df

,internet_service_type_id,contract_type_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,...,device_protection,tech_support,streaming_tv,streaming_movies,paperless_billing,payment_type_id,monthly_charges,total_charges,churn,contract_type
0,1,2,Female,0,Yes,Yes,9,Yes,No,No,...,No,Yes,Yes,No,Yes,2,65.6,593.3,No,One year
1,1,1,Male,0,No,No,9,Yes,Yes,No,...,No,No,No,Yes,No,2,59.9,542.4,No,Month-to-month
2,2,1,Male,0,No,No,4,Yes,No,No,...,Yes,No,No,No,Yes,1,73.9,280.85,Yes,Month-to-month
3,2,1,Male,1,Yes,No,13,Yes,No,No,...,Yes,No,Yes,Yes,Yes,1,98.0,1237.85,Yes,Month-to-month
4,2,1,Female,1,Yes,No,3,Yes,No,No,...,No,Yes,Yes,No,Yes,2,83.9,267.4,Yes,Month-to-month
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,1,2,Female,0,No,No,13,Yes,No,Yes,...,No,Yes,No,No,No,2,55.15,742.9,No,One year
7039,2,1,Male,0,Yes,No,22,Yes,Yes,No,...,No,No,No,Yes,Yes,1,85.1,1873.7,Yes,Month-to-month
7040,1,1,Male,0,No,No,2,Yes,No,No,...,No,No,No,No,Yes,2,50.3,92.75,No,Month-to-month
7041,1,3,Male,0,Yes,Yes,67,Yes,No,Yes,...,Yes,Yes,No,Yes,No,2,67.85,4627.65,No,Two year
7042,1,3,Male,0,Yes,Yes,63,No,No phone service,Yes,...,Yes,No,Yes,Yes,No,1,59.0,3707.6,No,Two year

Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

In [60]:
df['is_female'] = df.gender.map({'Female': 1, 'Male': 0})
df['has_partner'] = df.partner.map({'Yes': 1, 'No': 0})
df['has_dependents'] = df.dependents.map({'Yes': 1, 'No': 0})
df['has_phone_service'] = df.phone_service.map({'Yes': 1, 'No': 0})
df['uses_paperless_billing'] = df.paperless_billing.map({'Yes': 1, 'No': 0})
df['did_churn'] = df.churn.map({'Yes': 1, 'No': 0})
df['has_mult_lines'] = df.multiple_lines.map({'No' : 0, 'Yes' : 1,'No phone': 2 })
df['has_online_security'] = df.online_security.map({'No' : 0, 'Yes' : 1, 'No Internet Service' : 2})
df['has_online_backup'] = df.online_backup.map({'No' : 0, 'Yes' : 1, 'No Internet Service' : 2})
df['has_device_protection'] = df.device_protection.map({'No' : 0, 'Yes' : 1, 'No Internet Service' : 2})
df['has_tech_support'] = df.tech_support.map({'No' : 0, 'Yes' : 1, 'No Internet Service' : 2})
df['can_stream_tv'] = df.streaming_tv.map({'No' : 0, 'Yes' : 1, 'No Internet Service' : 2})
df['can_stream_movie'] = df.streaming_movies.map({'No' : 0, 'Yes' : 1, 'No Internet Service' : 2})

In [61]:
df

,internet_service_type_id,contract_type_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,...,has_phone_service,uses_paperless_billing,did_churn,has_mult_lines,has_online_security,has_online_backup,has_device_protection,has_tech_support,can_stream_tv,can_stream_movie
0,1,2,Female,0,Yes,Yes,9,Yes,No,No,...,1,1,0,0.0,0.0,1.0,0.0,1.0,1.0,0.0
1,1,1,Male,0,No,No,9,Yes,Yes,No,...,1,0,0,1.0,0.0,0.0,0.0,0.0,0.0,1.0
2,2,1,Male,0,No,No,4,Yes,No,No,...,1,1,1,0.0,0.0,0.0,1.0,0.0,0.0,0.0
3,2,1,Male,1,Yes,No,13,Yes,No,No,...,1,1,1,0.0,0.0,1.0,1.0,0.0,1.0,1.0
4,2,1,Female,1,Yes,No,3,Yes,No,No,...,1,1,1,0.0,0.0,0.0,0.0,1.0,1.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,1,2,Female,0,No,No,13,Yes,No,Yes,...,1,0,0,0.0,1.0,0.0,0.0,1.0,0.0,0.0
7039,2,1,Male,0,Yes,No,22,Yes,Yes,No,...,1,1,1,1.0,0.0,0.0,0.0,0.0,0.0,1.0
7040,1,1,Male,0,No,No,2,Yes,No,No,...,1,1,0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
7041,1,3,Male,0,Yes,Yes,67,Yes,No,Yes,...,1,0,0,0.0,1.0,0.0,1.0,1.0,0.0,1.0
7042,1,3,Male,0,Yes,Yes,63,No,No phone service,Yes,...,0,0,0,NaN,1.0,1.0,1.0,0.0,1.0,1.0

In [62]:
def prep_telco_data(FreshTelco):
    df = FreshTelco.T.drop_duplicates().T
    df = df.drop(columns = {'internet_service_type', 'customer_id','Unnamed: 0'})
    df['is_female'] = df.gender.map({'Female': 1, 'Male': 0})
    df['has_partner'] = df.partner.map({'Yes': 1, 'No': 0})
    df['has_dependents'] = df.dependents.map({'Yes': 1, 'No': 0})
    df['has_phone_service'] = df.phone_service.map({'Yes': 1, 'No': 0})
    df['uses_paperless_billing'] = df.paperless_billing.map({'Yes': 1, 'No': 0})
    df['did_churn'] = df.churn.map({'Yes': 1, 'No': 0})
    df['has_mult_lines'] = df.multiple_lines.map({'No' : 0, 'Yes' : 1,'No phone': 2 })
    df['has_online_security'] = df.online_security.map({'No' : 0, 'Yes' : 1, 'No Internet Service' : 2})
    df['has_online_backup'] = df.online_backup.map({'No' : 0, 'Yes' : 1, 'No Internet Service' : 2})
    df['has_device_protection'] = df.device_protection.map({'No' : 0, 'Yes' : 1, 'No Internet Service' : 2})
    df['has_tech_support'] = df.tech_support.map({'No' : 0, 'Yes' : 1, 'No Internet Service' : 2})
    df['can_stream_tv'] = df.streaming_tv.map({'No' : 0, 'Yes' : 1, 'No Internet Service' : 2})
    df['can_stream_movie'] = df.streaming_movies.map({'No' : 0, 'Yes' : 1, 'No Internet Service' : 2})
    return df

In [63]:
prep_telco_data(FreshTelco)

,internet_service_type_id,contract_type_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,...,has_phone_service,uses_paperless_billing,did_churn,has_mult_lines,has_online_security,has_online_backup,has_device_protection,has_tech_support,can_stream_tv,can_stream_movie
0,1,2,Female,0,Yes,Yes,9,Yes,No,No,...,1,1,0,0.0,0.0,1.0,0.0,1.0,1.0,0.0
1,1,1,Male,0,No,No,9,Yes,Yes,No,...,1,0,0,1.0,0.0,0.0,0.0,0.0,0.0,1.0
2,2,1,Male,0,No,No,4,Yes,No,No,...,1,1,1,0.0,0.0,0.0,1.0,0.0,0.0,0.0
3,2,1,Male,1,Yes,No,13,Yes,No,No,...,1,1,1,0.0,0.0,1.0,1.0,0.0,1.0,1.0
4,2,1,Female,1,Yes,No,3,Yes,No,No,...,1,1,1,0.0,0.0,0.0,0.0,1.0,1.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,1,2,Female,0,No,No,13,Yes,No,Yes,...,1,0,0,0.0,1.0,0.0,0.0,1.0,0.0,0.0
7039,2,1,Male,0,Yes,No,22,Yes,Yes,No,...,1,1,1,1.0,0.0,0.0,0.0,0.0,0.0,1.0
7040,1,1,Male,0,No,No,2,Yes,No,No,...,1,1,0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
7041,1,3,Male,0,Yes,Yes,67,Yes,No,Yes,...,1,0,0,0.0,1.0,0.0,1.0,1.0,0.0,1.0
7042,1,3,Male,0,Yes,Yes,63,No,No phone service,Yes,...,0,0,0,NaN,1.0,1.0,1.0,0.0,1.0,1.0

Split your data

Write a function to split your data into train, test and validate datasets. Add this function to prepare.py.

In [71]:
def my_train_test_split(df, target):

    train, test = train_test_split(df, test_size=.2, random_state=123, stratify=df[target])
    train, validate = train_test_split(train, test_size=.25, random_state=123, stratify=train[target])

    return train, validate, test

In [81]:
train,validate,test = my_train_test_split(prep_telco_data(FreshTelco), 'did_churn')

In [79]:
train,validate,test = my_train_test_split(prep_iris(fresh_iris), 'species')

In [80]:
train,validate,test = my_train_test_split(prep_titanic(FreshTitanic), 'survived')

In [82]:
train

,internet_service_type_id,contract_type_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,...,has_phone_service,uses_paperless_billing,did_churn,has_mult_lines,has_online_security,has_online_backup,has_device_protection,has_tech_support,can_stream_tv,can_stream_movie
5911,1,2,Male,0,No,Yes,26,No,No phone service,No,...,0,1,0,NaN,0.0,1.0,0.0,0.0,1.0,0.0
2479,3,2,Female,0,Yes,No,47,Yes,Yes,No internet service,...,1,0,0,1.0,NaN,NaN,NaN,NaN,NaN,NaN
5889,1,1,Female,0,No,No,1,Yes,No,No,...,1,1,1,0.0,0.0,0.0,1.0,0.0,0.0,0.0
6087,1,3,Male,0,No,No,69,No,No phone service,Yes,...,0,1,0,NaN,1.0,1.0,0.0,1.0,1.0,1.0
785,2,2,Female,0,No,No,51,Yes,No,No,...,1,0,0,0.0,0.0,0.0,0.0,0.0,1.0,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6102,2,1,Female,0,Yes,No,2,Yes,No,No,...,1,0,1,0.0,0.0,1.0,1.0,0.0,0.0,0.0
356,1,1,Female,1,No,No,52,No,No phone service,No,...,0,1,0,NaN,0.0,1.0,1.0,1.0,1.0,0.0
1756,2,1,Male,0,No,No,4,Yes,No,No,...,1,1,1,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2127,1,3,Male,0,No,No,35,Yes,Yes,Yes,...,1,0,0,1.0,1.0,0.0,0.0,0.0,0.0,0.0
3586,1,2,Female,0,No,No,10,Yes,No,No,...,1,0,0,0.0,0.0,1.0,0.0,1.0,0.0,1.0

In [83]:
validate

,internet_service_type_id,contract_type_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,...,has_phone_service,uses_paperless_billing,did_churn,has_mult_lines,has_online_security,has_online_backup,has_device_protection,has_tech_support,can_stream_tv,can_stream_movie
3554,2,2,Female,0,No,No,56,Yes,Yes,No,...,1,1,0,1.0,0.0,1.0,1.0,0.0,1.0,1.0
2063,1,2,Female,0,No,No,67,Yes,No,Yes,...,1,0,0,0.0,1.0,1.0,0.0,1.0,0.0,0.0
1737,2,1,Male,1,Yes,No,17,Yes,No,No,...,1,1,1,0.0,0.0,1.0,0.0,0.0,0.0,0.0
5894,3,3,Female,0,Yes,Yes,45,Yes,Yes,No internet service,...,1,1,0,1.0,NaN,NaN,NaN,NaN,NaN,NaN
209,2,1,Female,1,Yes,No,68,Yes,Yes,No,...,1,1,1,1.0,0.0,1.0,0.0,0.0,1.0,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2529,2,1,Female,1,Yes,No,14,Yes,Yes,No,...,1,1,1,1.0,0.0,1.0,0.0,0.0,1.0,1.0
6540,2,1,Male,0,Yes,Yes,13,Yes,Yes,No,...,1,1,1,1.0,0.0,0.0,0.0,0.0,0.0,0.0
5765,2,3,Male,0,Yes,No,72,Yes,Yes,No,...,1,1,0,1.0,0.0,1.0,1.0,0.0,1.0,1.0
6959,1,3,Female,0,No,Yes,34,Yes,No,Yes,...,1,0,0,0.0,1.0,0.0,1.0,1.0,1.0,0.0
3108,2,2,Female,0,Yes,No,61,Yes,Yes,No,...,1,0,0,1.0,0.0,0.0,0.0,1.0,1.0,1.0

In [84]:
test

,internet_service_type_id,contract_type_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,...,has_phone_service,uses_paperless_billing,did_churn,has_mult_lines,has_online_security,has_online_backup,has_device_protection,has_tech_support,can_stream_tv,can_stream_movie
3160,2,2,Female,0,Yes,Yes,51,Yes,Yes,Yes,...,1,1,0,1.0,1.0,0.0,0.0,1.0,1.0,0.0
1577,1,3,Female,0,Yes,No,65,Yes,No,Yes,...,1,0,0,0.0,1.0,1.0,1.0,0.0,0.0,1.0
6823,2,1,Female,0,No,No,18,Yes,No,Yes,...,1,1,1,0.0,1.0,0.0,0.0,0.0,1.0,1.0
3615,2,1,Male,0,No,No,25,Yes,No,Yes,...,1,1,0,0.0,1.0,0.0,1.0,1.0,1.0,1.0
882,2,1,Female,1,No,No,4,Yes,Yes,No,...,1,1,1,1.0,0.0,0.0,1.0,0.0,0.0,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1097,1,1,Female,0,No,No,2,Yes,No,No,...,1,0,1,0.0,0.0,0.0,1.0,1.0,1.0,1.0
6441,1,1,Male,0,No,No,1,Yes,No,No,...,1,1,1,0.0,0.0,0.0,0.0,0.0,0.0,0.0
5985,3,3,Female,0,No,No,67,Yes,Yes,No internet service,...,1,1,0,1.0,NaN,NaN,NaN,NaN,NaN,NaN
2452,1,3,Male,0,Yes,Yes,72,No,No phone service,Yes,...,0,0,0,NaN,1.0,1.0,1.0,0.0,0.0,0.0
983,2,1,Male,0,No,No,11,Yes,No,No,...,1,1,1,0.0,0.0,1.0,0.0,0.0,0.0,0.0